Repository: goanpeca/jupyterlab-language-packs
Catalog: extensions/jupyterlab_git/locale/*/LC_MESSAGES/jupyterlab_git.po
Languages: ar_sa

source: Suspend user interaction until commands finish
ar_sa: تعليق تفاعل المستخدم حتى تنتهي الأوامر

# schema
source: Suspend JupyterLab user interaction until Git commands (e.g., commit, pull, reset, revert) finish executing. Setting this to true helps mitigate potential race conditions leading to data loss, conflicts, and a broken Git history. Unless running a slow network, UI suspension should not interfere with standard workflows. Setting this to false allows for actions to trigger multiple concurrent Git actions.
ar_sa: تعليق تفاعل مستخدم JupyterLab حتى تنتهي أوامر Git (على سبيل المثال، الالتزام، السحب، إعادة الضبط، الرجوع) من التنفيذ. ويساعد تحديد هذا الأمر على "صحيح" على التخفيف من الظروف العرقية المحتملة التي تؤدي إلى فقدان البيانات، تضاربات ، و سجل Git مكسور. ما لم يتم تشغيل شبكة بطيئة، يجب ألا يتدخل تعليق واجهة المستخدم في سير العمل القياسية. إن تعيين هذا الخيار إلى "خطأ" يسمح بالإجراءات لتفعيل العديد من إجراءات Git المتزامنة.

source: Cancel pull merge conflict
ar_sa: إلغاء تضارب اندماج السحب

# schema
source: If true, when fetching and integrating changes from a remote repository, a conflicting merge is canceled and the working tree left untouched.
ar_sa: إذا كان "صحيحا"، عند جلب ودمج التغييرات من المستودع عن بعد، يتم إلغاء الدمج المتضارب وتبقى الشجرة العاملة كما هي.

source: Disable branch with changes
ar_sa: تعطيل الفرع مع التغيرات

# schema
source: Disable all branch operations (new, switch) when there are changed/staged files
ar_sa: تعطيل جميع عمليات التفرع (تجديد، تبديل) عندما تكون هناك ملفات متغيرة/مهيأة

source: Display Git status updates
ar_sa: عرض حالة التحديثات ل Git

# schema
source: Display Git extension status updates in the JupyterLab status bar. If true, the extension displays status updates in the JupyterLab status bar, such as when pulling and pushing changes, switching branches, and polling for changes. Depending on the level of extension activity, some users may find the status updates distracting. In which case, setting this to false should reduce visual noise.
ar_sa: عرض تحديثات Git في شريط حالة JupyterLab. إذا كان صحيحاً، يعرض الملحق تحديثات الحالة في شريط حالة JupyterLab ، مثل عند السحب ودفع التغييرات، تبديل الفروع، والاستفتاء للتغييرات. تبعاً لمستوى نشاط الإضافة، قد يجد بعض المستخدمين تحديثات الحالة مشتتة. وفي هذه الحالة، فإن تبديل هذه القيمه إلى false ينبغي أن يقلل من الضوضاء البصرية.

source: Show diff on double click
ar_sa: إظهار الاختلافات عند الضغط مرتين

# schema
source: If true, doubling clicking a file in the list of changed files will open a diff.
ar_sa: إذا كان صحيحاً، فإن النقر المزدوج فوق ملف في قائمة الملفات المتغيرة سوف يفتح فتحاً مختلفاً.

source: History count
ar_sa: عدد السجلات

# schema
source: Number of (most recent) commits shown in the history log
ar_sa: عدد (الأحدث عهدا) الالتزامات المبينة في سجل التاريخ

source: Refresh interval
ar_sa: الفاصل الزمني للتحديث

# schema
source: Number of milliseconds between polling the file system for changes.
ar_sa: عدد المللي ثانية بين التصويت لنظام الملفات للتغييرات.

# schema
source: jupyterlab-git settings.
ar_sa: إعدادات jupyterlab-git.

source: Simple staging flag
ar_sa: علامة التجهيز البسيطة

# schema
source: If true, use a simplified concept of staging. Only files with changes are shown (instead of showing staged/changed/untracked), and all files with changes will be automatically staged
ar_sa: إذا كان صحيحاً، استخدم مفهوماً مبسطاً للتجهيز التدريجي. فقط الملفات مع التغييرات تظهر (بدلاً من إظهار مقدّم/تغيير/غير متعقب)، وسيتم تلقائياً تجهيز جميع الملفات مع التغييرات
